RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f65xxx_66xxx_pga.c
/*********************************************************************************************************//**
 * @file    ht32f65xxx_66xxx_pga.c
 * @version $Rev:: 8260         $
 * @date    $Date:: 2024-11-05 #$
 * @brief   This file provides all the PGA firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f65xxx_66xxx_pga.h"

/** @addtogroup HT32F5xxxx_Peripheral_Driver HT32F5xxxx Peripheral Driver
  * @{
  */

/** @defgroup PGA PGA
  * @brief PGA driver modules
  * @{
  */

/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup PGA_Private_Define PGA private definitions
  * @{
  */
#define PGA_ENABLE                               (0x00000001ul)

#define CR_REF_POS                               10
#define CR_HVDDA_POS                             8

#define CR_OUTPUT_HIGH                           (1)
#define CR_OUTPUT_POS                            7

#define CR_GAIN_POS                              4
#define CR_GAIN_MASK                             (0x7ul << CR_GAIN_POS)

#define CR_NE_POS                                3

#define CR_PGA_POS                               2

#define CR_NUG_POS                               1

#define VOS_OFM_CALIBRATION_MODE                 (1)
#define VOS_OFM_POS                              7

#define VOS_RSP_POS                              6

#define VOS_OF_DEFAULT_VALUE                     (0x10)
#define VOS_OF_POS                               0
#define VOS_OF_MASK                              (0x1Ful << VOS_OF_POS)

#define VR_VFEN_SET                              ((u32)0x00000001)
#define VR_VFEN_RESET                            ((u32)0xFFFFFFFE)

#define PGA0_OF_WITH_CALIBRATION              0x1
#define PGA1_OF_WITH_CALIBRATION              0x2
#define PGA2_OF_WITH_CALIBRATION              0x4
#define PGA3_OF_WITH_CALIBRATION              0x8
/**
  * @}
  */
/* Private macro -------------------------------------------------------------------------------------------*/
/** @defgroup PGA_Private_Macro PGA private macros
  * @{
  */
#define IS_PGA0(x)                               (x == HT_PGA0)
#if (LIBCFG_PGA1)
#define IS_PGA1(x)                               (x == HT_PGA1)
#else
#define IS_PGA1(x)                               (0)
#endif
#if (LIBCFG_PGA2)
#define IS_PGA2(x)                               (x == HT_PGA2)
#else
#define IS_PGA2(x)                               (0)
#endif
#if (LIBCFG_PGA3)
#define IS_PGA3(x)                               (x == HT_PGA3)
#else
#define IS_PGA3(x)                               (0)
#endif
#define IS_PGA(x)                                (IS_PGA0(x) || \
                                                  IS_PGA1(x) || \
                                                  IS_PGA2(x) || \
                                                  IS_PGA3(x))

#define IS_PGA_HVDDA_OPTION(x)                   ((x == PGA_HVDDA_DISABLE) || \
                                                  (x == PGA_HVDDA_RESISTOR) || \
                                                  (x == PGA_HVDDA_POS_INPUT))

#define IS_PGA_GAIN(x)                           ((x == PGA_GAIN_LEVEL_0) || \
                                                  (x == PGA_GAIN_LEVEL_1) || \
                                                  (x == PGA_GAIN_LEVEL_2) || \
                                                  (x == PGA_GAIN_LEVEL_3) || \
                                                  (x == PGA_GAIN_LEVEL_4) || \
                                                  (x == PGA_GAIN_LEVEL_5))

#define IS_PGA_INPUT(x)                          ((x == PGA_INPUT_NEGATIVE)  || \
                                                  (x == PGA_INPUT_POSITIVE))

/**
  * @}
  */

/* Private variables ---------------------------------------------------------------------------------------*/
static u32 gPGAUnProtectKey = 0;
static vu32 gPGACaliValInit = 0;

/* Global functions ----------------------------------------------------------------------------------------*/
/** @defgroup PGA_Exported_Functions PGA exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitialize the PGA peripheral registers to their default reset values.
 * @retval None
 ************************************************************************************************************/
void PGA_DeInit(void)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};

  RSTCUReset.Bit.PGA = 1;
  RSTCU_PeripReset(RSTCUReset, ENABLE);

  gPGACaliValInit = 0;
}

