RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f65xxx_66xxx_pga.c
/*********************************************************************************************************//**
 * @brief Enable or Disable the specified PGA peripheral.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
*************************************************************************************************************/
void PGA_Cmd(HT_PGA0_X_TypeDef* HT_PGAn, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  HT_PGAn->CR = gPGAUnProtectKey;

  if (NewState != DISABLE)
  {
    /* Enable the selected HT_PGAn peripheral                                                               */
    HT_PGAn->CR |= PGA_ENABLE;
  }
  else
  {
    /* Disable the selected HT_PGAn peripheral                                                              */
    HT_PGAn->CR &= ~(u32)PGA_ENABLE;
  }
}

/*********************************************************************************************************//**
 * @brief Set the unprotect key.
 * @param uUnProtectKey: protect key, shall be PGA_UNPROTECT_KEY
 * @retval None
 ************************************************************************************************************/
void PGA_SetUnProtectKey(u32 uUnProtectKey)
{
  gPGAUnProtectKey = uUnProtectKey << 16;
}

/*********************************************************************************************************//**
 * @brief Protect the selected PGA before setting the PGA Control Register.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @retval None
 ************************************************************************************************************/
void PGA_ProtectConfig(HT_PGA0_X_TypeDef* HT_PGAn)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));

  /* Write any value to bit 16 ~ 31 (PROTECT) and keep the other control bit                                */
  HT_PGAn->CR = HT_PGAn->CR;
}

/*********************************************************************************************************//**
 * @brief Unprotect the selected PGA before setting the PGA Control Register.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @retval None
 ************************************************************************************************************/
void PGA_UnprotectConfig(HT_PGA0_X_TypeDef* HT_PGAn)
{
  u32 CRValue;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));

  /* Set the unlock code corresponding to selected PGA                                                      */
  CRValue = HT_PGAn->CR & 0x0000FFFF;
  HT_PGAn->CR = gPGAUnProtectKey | CRValue;
}

/*********************************************************************************************************//**
 * @brief Initialize the PGA peripheral according to the specified parameters in the PGA_InitStruct.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @param PGA_InitStruct: pointer to a PGA_InitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void PGA_Init(HT_PGA0_X_TypeDef* HT_PGAn, PGA_InitTypeDef* PGA_InitStruct)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));
  Assert_Param(IS_PGA_HVDDA_OPTION(PGA_InitStruct->PGA_HVDDA));

  /* According to the HT_PGAn calibration value flag, initialize the calibration value to 0x10 if needed.   */
  if((HT_PGAn == HT_PGA0) && !(gPGACaliValInit & PGA0_OF_WITH_CALIBRATION))
  {
    HT_PGA0->VOS = 0x00000090;
    HT_PGA0->VOS &= 0xFFFFFF7F;
  }
  #if (LIBCFG_PGA1)
  else if((HT_PGAn == HT_PGA1) && !(gPGACaliValInit & PGA1_OF_WITH_CALIBRATION))
  {
    HT_PGA1->VOS = 0x00000090;
    HT_PGA1->VOS &= 0xFFFFFF7F;
  }
  #endif
  #if (LIBCFG_PGA2)
  else if((HT_PGAn == HT_PGA2) && !(gPGACaliValInit & PGA2_OF_WITH_CALIBRATION))
  {
    HT_PGA2->VOS = 0x00000090;
    HT_PGA2->VOS &= 0xFFFFFF7F;
  }
  #endif
  #if (LIBCFG_PGA3)
  else if((HT_PGAn == HT_PGA3) && !(gPGACaliValInit & PGA3_OF_WITH_CALIBRATION))
  {
    HT_PGA3->VOS = 0x00000090;
    HT_PGA3->VOS &= 0xFFFFFF7F;
  }
  #endif

  HT_PGAn->CR = gPGAUnProtectKey;

  HT_PGAn->CR = (u32)PGA_InitStruct->PGA_REF   << CR_REF_POS | \
                (u32)PGA_InitStruct->PGA_NUG   << CR_NUG_POS | \
                (u32)PGA_InitStruct->PGA_NE    << CR_NE_POS  | \
                (u32)PGA_InitStruct->PGA_PGA   << CR_PGA_POS | \
                (u32)PGA_InitStruct->PGA_HVDDA << CR_HVDDA_POS;
}

/*********************************************************************************************************//**
 * @brief Fill each PGA_InitStruct member with its default value.
 * @param PGA_InitStruct: pointer to an PGA_InitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void PGA_StructInit(PGA_InitTypeDef* PGA_InitStruct)
{
  /* PGA_InitStruct members default value                                                                   */
  PGA_InitStruct->PGA_REF   = DISABLE;
  PGA_InitStruct->PGA_NUG   = DISABLE;
  PGA_InitStruct->PGA_NE    = DISABLE;
  PGA_InitStruct->PGA_PGA   = DISABLE;
  PGA_InitStruct->PGA_HVDDA = PGA_HVDDA_DISABLE;
}

/*********************************************************************************************************//**
 * @brief Configure the Gain for the selected PGA Control Register.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @param PGA_GAIN_LEVEL_x: Where PGA_GAIN_LEVEL_x is the Gain for PGA resistor.
 *   This parameter can be one of the following values:
 *     @arg PGA_GAIN_LEVEL_0
 *     @arg PGA_GAIN_LEVEL_1
 *     @arg PGA_GAIN_LEVEL_2
 *     @arg PGA_GAIN_LEVEL_3
 *     @arg PGA_GAIN_LEVEL_4
 *     @arg PGA_GAIN_LEVEL_5
 * @retval None
 ************************************************************************************************************/
void PGA_GainConfig(HT_PGA0_X_TypeDef* HT_PGAn, u32 PGA_GAIN_LEVEL_x)
{
  u32 CRValue;

