RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f65xxx_66xxx_pga.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));
  Assert_Param(IS_PGA_GAIN(PGA_GAIN_LEVEL_x));

  CRValue = HT_PGAn->CR & 0x0000FFFF;
  CRValue &= ~CR_GAIN_MASK;

  HT_PGAn->CR = gPGAUnProtectKey;
  HT_PGAn->CR = ((u32)PGA_GAIN_LEVEL_x << CR_GAIN_POS) | CRValue;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the PGAHVDDA Voltage Follower.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
*************************************************************************************************************/
void PGA_HVDDACmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if(NewState != DISABLE)
  {
    /* Enable the selected HT_PGAn peripheral                                                               */
    HT_PGA->VR |= (u32)VR_VFEN_SET;
  }
  else
  {
    /* Disable the selected HT_PGAn peripheral                                                              */
    HT_PGA->VR &= (u32)VR_VFEN_RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the Calibration mode.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
*************************************************************************************************************/
void PGA_CalibrationCmd(HT_PGA0_X_TypeDef* HT_PGAn, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if(NewState != DISABLE)
  {
    HT_PGAn->VOS |= (u32)VOS_OFM_CALIBRATION_MODE << VOS_OFM_POS;
    /*
       Set the HT_PGAn calibration value flag to true to ensure that the calibration value does not change 
       after executing calibration.
    */
    if(HT_PGAn == HT_PGA0)
    {
      gPGACaliValInit |= PGA0_OF_WITH_CALIBRATION;
    }
    #if (LIBCFG_PGA1)
    else if(HT_PGAn == HT_PGA1)
    {
      gPGACaliValInit |= PGA1_OF_WITH_CALIBRATION;
    }
    #endif
    #if (LIBCFG_PGA2)
    else if(HT_PGAn == HT_PGA2)
    {
      gPGACaliValInit |= PGA2_OF_WITH_CALIBRATION;
    }
    #endif
    #if (LIBCFG_PGA3)
    else if(HT_PGAn == HT_PGA3)
    {
      gPGACaliValInit |= PGA3_OF_WITH_CALIBRATION;
    }
    #endif
  }
  else
  {
    HT_PGAn->VOS &= ~((u32)VOS_OFM_CALIBRATION_MODE << VOS_OFM_POS);
  }
}

/*********************************************************************************************************//**
 * @brief Configure the direction of Calibration reference pins.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @param PGA_INPUT_x: where PGA_INPUT_x is the calibration reference.
 *   This parameter can be one of the following values:
 *     @arg PGA_INPUT_NEGATIVE
 *     @arg PGA_INPUT_POSITIVE
 * @retval None
*************************************************************************************************************/
void PGA_SetCalibrationInput(HT_PGA0_X_TypeDef* HT_PGAn, PGA_CALIBRATION_INPUT_Enum PGA_INPUT_x)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));
  Assert_Param(IS_PGA_INPUT(PGA_INPUT_x));

  if(PGA_INPUT_x == PGA_CALIBRATION_INPUT_NEGATIVE)
  {
    PGA_UnprotectConfig(HT_PGAn);
    HT_PGAn->CR  |= (u32)ENABLE << CR_NE_POS;
    HT_PGAn->VOS &= ~((u32)ENABLE << VOS_RSP_POS);
  }
  else
  {
    HT_PGAn->VOS |= (u32)ENABLE << VOS_RSP_POS;
  }
}

/*********************************************************************************************************//**
 * @brief Configure the calibration value.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @param Value: the calibration value.
 * @retval None
*************************************************************************************************************/
void PGA_SetCalibrationValue(HT_PGA0_X_TypeDef* HT_PGAn, u32 Value)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));

  HT_PGAn->VOS = (HT_PGAn->VOS & ~(u32)(VOS_OF_MASK)) | Value;
}

/*********************************************************************************************************//**
 * @brief Check whether the specified PID flag has been set.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @retval None
*************************************************************************************************************/
FlagStatus PGA_ReadOutputBit(HT_PGA0_X_TypeDef* HT_PGAn)
{
  FlagStatus Status;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));

  if ((HT_PGAn->CR & ((u32)CR_OUTPUT_HIGH << CR_OUTPUT_POS)) != RESET)
  {
    Status = SET;
  }
  else
  {
    Status = RESET;
  }

  return Status;
}

/*********************************************************************************************************//**
 * @brief Set Inverting Amplifier Mode of the specified HT_PGAn.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @param PGA_GAIN_x: Where PGA_GAIN_x is the Gain for PGA resistor.
 *   This parameter can be one of the following values:
 *     @arg PGA_GAIN_6
 *     @arg PGA_GAIN_8
 *     @arg PGA_GAIN_12
 *     @arg PGA_GAIN_16
 *     @arg PGA_GAIN_24
 *     @arg PGA_GAIN_32
 * @retval None
 * @note Model configuration must follow the rules below:
 *       Inverting Amplifier Mode : The positive input must be grounded.
 ************************************************************************************************************/
void PGA_SetModeInverting(HT_PGA0_X_TypeDef* HT_PGAn, PGA_GAIN_TYPE1_Enum PGA_GAIN_x)
{
  PGA_InitTypeDef PGA_InitStruct;

