RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f65xxx_66xxx_pga.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));
  Assert_Param(IS_PGA_GAIN(PGA_GAIN_x));

  PGA_InitStruct.PGA_REF   = ENABLE;
  PGA_InitStruct.PGA_NUG   = DISABLE;
  PGA_InitStruct.PGA_NE    = DISABLE;
  PGA_InitStruct.PGA_PGA   = ENABLE;
  PGA_InitStruct.PGA_HVDDA = PGA_HVDDA_DISABLE;

  PGA_Init(HT_PGAn, &PGA_InitStruct);
  PGA_GainConfig(HT_PGAn, PGA_GAIN_x);
}

/*********************************************************************************************************//**
 * @brief Set the Differentiator Mode of the specified HT_PGAn.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @param PGA_GAIN_LEVEL_x: Where PGA_GAIN_LEVEL_x is the Gain for PGA resistor.
 *   This parameter can be one of the following values:
 *     @arg PGA_GAIN_LEVEL_0
 *     @arg PGA_GAIN_LEVEL_1
 *     @arg PGA_GAIN_LEVEL_2
 *     @arg PGA_GAIN_LEVEL_3
 *     @arg PGA_GAIN_LEVEL_4
 *     @arg PGA_GAIN_LEVEL_5
 * @retval None
 * @note Model configuration must follow the rules below:
 *       Differentiator           : The positive input must have an external capacitor and be grounded.
 ************************************************************************************************************/
void PGA_SetModeDifferentiator(HT_PGA0_X_TypeDef* HT_PGAn, u32 PGA_GAIN_LEVEL_x)
{
  PGA_InitTypeDef PGA_InitStruct;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));
  Assert_Param(IS_PGA_GAIN(PGA_GAIN_LEVEL_x));

  PGA_InitStruct.PGA_REF   = ENABLE;
  PGA_InitStruct.PGA_NUG   = DISABLE;
  PGA_InitStruct.PGA_NE    = DISABLE;
  PGA_InitStruct.PGA_PGA   = ENABLE;
  PGA_InitStruct.PGA_HVDDA = PGA_HVDDA_DISABLE;

  PGA_Init(HT_PGAn, &PGA_InitStruct);
  PGA_GainConfig(HT_PGAn, PGA_GAIN_LEVEL_x);
}

/*********************************************************************************************************//**
 * @brief Set the Non-Inverting Amplifier Mode of the specified HT_PGAn.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @param PGA_GAIN_x: Where PGA_GAIN_x is the Gain for PGA resistor.
 *   This parameter can be one of the following values:
 *     @arg PGA_GAIN_6
 *     @arg PGA_GAIN_8
 *     @arg PGA_GAIN_12
 *     @arg PGA_GAIN_16
 *     @arg PGA_GAIN_24
 *     @arg PGA_GAIN_32
 * @retval None
 ************************************************************************************************************/
void PGA_SetModeNonInverting(HT_PGA0_X_TypeDef* HT_PGAn, PGA_GAIN_TYPE1_Enum PGA_GAIN_x)
{
  PGA_InitTypeDef PGA_InitStruct;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));
  Assert_Param(IS_PGA_GAIN(PGA_GAIN_x));

  PGA_InitStruct.PGA_REF   = DISABLE;
  PGA_InitStruct.PGA_NUG   = DISABLE;
  PGA_InitStruct.PGA_NE    = DISABLE;
  PGA_InitStruct.PGA_PGA   = ENABLE;
  PGA_InitStruct.PGA_HVDDA = PGA_HVDDA_DISABLE;

  PGA_Init(HT_PGAn, &PGA_InitStruct);
  PGA_GainConfig(HT_PGAn, PGA_GAIN_x);
}

/*********************************************************************************************************//**
 * @brief Set the Inverting Adder Mode of the specified HT_PGAn.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @param PGA_GAIN_LEVEL_x: Where PGA_GAIN_LEVEL_x is the Gain for PGA resistor.
 *   This parameter can be one of the following values:
 *     @arg PGA_GAIN_LEVEL_0
 *     @arg PGA_GAIN_LEVEL_1
 *     @arg PGA_GAIN_LEVEL_2
 *     @arg PGA_GAIN_LEVEL_3
 *     @arg PGA_GAIN_LEVEL_4
 *     @arg PGA_GAIN_LEVEL_5
 * @retval None
 * @note Model configuration must follow the rules below:
 *       Inverting Adder Mode    : The positive input must be grounded.
 *                                 The negative input must be voltage divider.
 ************************************************************************************************************/
void PGA_SetModeInvertingAdder(HT_PGA0_X_TypeDef* HT_PGAn, u32 PGA_GAIN_LEVEL_x)
{
  PGA_InitTypeDef PGA_InitStruct;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));
  Assert_Param(IS_PGA_GAIN(PGA_GAIN_LEVEL_x));

  PGA_InitStruct.PGA_REF   = ENABLE;
  PGA_InitStruct.PGA_NUG   = DISABLE;
  PGA_InitStruct.PGA_NE    = ENABLE;
  PGA_InitStruct.PGA_PGA   = ENABLE;
  PGA_InitStruct.PGA_HVDDA = PGA_HVDDA_DISABLE;

  PGA_Init(HT_PGAn, &PGA_InitStruct);
  PGA_GainConfig(HT_PGAn, PGA_GAIN_LEVEL_x);
}

/*********************************************************************************************************//**
 * @brief Set the Exponent Amplifier Mode of the specified HT_PGAn.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @param PGA_GAIN_LEVEL_x: Where PGA_GAIN_LEVEL_x is the Gain for PGA resistor.
 *   This parameter can be one of the following values:
 *     @arg PGA_GAIN_LEVEL_0
 *     @arg PGA_GAIN_LEVEL_1
 *     @arg PGA_GAIN_LEVEL_2
 *     @arg PGA_GAIN_LEVEL_3
 *     @arg PGA_GAIN_LEVEL_4
 *     @arg PGA_GAIN_LEVEL_5
 * @retval None
 * @note Model configuration must follow the rules below:
 *       Exponent Amplifier Mode : The positive input must be grounded.
 *                                 The negative input must have an external diode.
 ************************************************************************************************************/
void PGA_SetModeExponent(HT_PGA0_X_TypeDef* HT_PGAn, u32 PGA_GAIN_LEVEL_x)
{
  PGA_InitTypeDef PGA_InitStruct;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));
  Assert_Param(IS_PGA_GAIN(PGA_GAIN_LEVEL_x));

  PGA_InitStruct.PGA_REF   = ENABLE;
  PGA_InitStruct.PGA_NUG   = DISABLE;
  PGA_InitStruct.PGA_NE    = ENABLE;
  PGA_InitStruct.PGA_PGA   = ENABLE;
  PGA_InitStruct.PGA_HVDDA = PGA_HVDDA_DISABLE;

