RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f65xxx_66xxx_pga.c
  PGA_Init(HT_PGAn, &PGA_InitStruct);
  PGA_GainConfig(HT_PGAn, PGA_GAIN_LEVEL_x);
}

/*********************************************************************************************************//**
 * @brief Set the Manual Mode of the specified HT_PGAn.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @retval None
 * @note This mode prototype is a voltage follower, and the following modes can be used
 *       with external components:
 *       Peak Detector
 *       Active Filter
 *       R-2R D/A conversion circuit (+)
 ************************************************************************************************************/
void PGA_SetModeManual(HT_PGA0_X_TypeDef* HT_PGAn)
{
  PGA_InitTypeDef PGA_InitStruct;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));

  PGA_InitStruct.PGA_REF   = ENABLE;
  PGA_InitStruct.PGA_NUG   = ENABLE;
  PGA_InitStruct.PGA_NE    = DISABLE;
  PGA_InitStruct.PGA_PGA   = DISABLE;
  PGA_InitStruct.PGA_HVDDA = PGA_HVDDA_DISABLE;

  PGA_Init(HT_PGAn, &PGA_InitStruct);
}

/*********************************************************************************************************//**
 * @brief Set the Non-Inverting Adder Mode of the specified HT_PGAn.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @param PGA_GAIN_x: Where PGA_GAIN_x is the Gain for PGA resistor.
 *   This parameter can be one of the following values:
 *     @arg PGA_GAIN_6
 *     @arg PGA_GAIN_8
 *     @arg PGA_GAIN_12
 *     @arg PGA_GAIN_16
 *     @arg PGA_GAIN_24
 *     @arg PGA_GAIN_32
 * @retval None
 * @note Model configuration must follow the rules below:
 *       Non-Inverting Adder : The positive input must be voltage divider.
 *                             The negative input must be grounded.
 ************************************************************************************************************/
void PGA_SetModeNonInvertingAdder(HT_PGA0_X_TypeDef* HT_PGAn, PGA_GAIN_TYPE1_Enum PGA_GAIN_x)
{
  PGA_InitTypeDef PGA_InitStruct;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));
  Assert_Param(IS_PGA_GAIN(PGA_GAIN_x));

  PGA_InitStruct.PGA_REF   = DISABLE;
  PGA_InitStruct.PGA_NUG   = DISABLE;
  PGA_InitStruct.PGA_NE    = DISABLE;
  PGA_InitStruct.PGA_PGA   = ENABLE;
  PGA_InitStruct.PGA_HVDDA = PGA_HVDDA_DISABLE;

  PGA_Init(HT_PGAn, &PGA_InitStruct);
  PGA_GainConfig(HT_PGAn, PGA_GAIN_x);
}

/*********************************************************************************************************//**
 * @brief Set the Comparator Mode of the specified HT_PGAn.
 * @param HT_PGAn: where HT_PGAn is the selected PGA from the PGA peripherals.
 * @retval None
 ************************************************************************************************************/
void PGA_SetModeComparator(HT_PGA0_X_TypeDef* HT_PGAn)
{
  PGA_InitTypeDef PGA_InitStruct;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_PGA(HT_PGAn));

  PGA_InitStruct.PGA_REF   = DISABLE;
  PGA_InitStruct.PGA_NUG   = DISABLE;
  PGA_InitStruct.PGA_NE    = ENABLE;
  PGA_InitStruct.PGA_PGA   = DISABLE;
  PGA_InitStruct.PGA_HVDDA = PGA_HVDDA_DISABLE;

  PGA_Init(HT_PGAn, &PGA_InitStruct);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
